In [2]:
import pandas as pd

In [3]:
from pandas import Series , DataFrame

# Series

In [3]:
obj = pd.Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj["index"]

KeyError: 'index'

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [9]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [16]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [17]:
obj2['a']

-5

In [18]:
obj2['d'] = 6

In [19]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [21]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [22]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [23]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [24]:
import numpy as np

In [25]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [26]:
'b' in obj2

True

In [27]:
'e' in obj2

False

In [78]:
 sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000 , "Pakistan":1000 }

In [79]:
obj3 = pd.Series(sdata)

In [80]:
obj3

Ohio        35000
Texas       71000
Oregon      16000
Utah         5000
Pakistan     1000
dtype: int64

In [81]:
states = ['California', 'Ohio', 'Oregon', 'Texas'  , "Utah"]

In [82]:
obj4 = pd.Series(sdata, index=states)

In [83]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
dtype: float64

In [14]:
sdata = {'Ohio': 35000, 'Utah': 71000, 'Oregon': 16000, 'Texas': 5000}
obj3 = pd.Series(sdata)
print(obj3)

Ohio      35000
Utah      71000
Oregon    16000
Texas      5000
dtype: int64

In [19]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)

In [20]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas          5000.0
dtype: float64

In [84]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
Utah          False
dtype: bool

In [85]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
Utah           True
dtype: bool

In [86]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
Utah          False
dtype: bool

In [87]:
obj3

Ohio        35000
Texas       71000
Oregon      16000
Utah         5000
Pakistan     1000
dtype: int64

In [88]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
dtype: float64

In [89]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Pakistan           NaN
Texas         142000.0
Utah           10000.0
dtype: float64

In [90]:
obj4.name = 'population'

In [95]:
obj4.index.name = 'state'

In [96]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
Name: population, dtype: float64

In [97]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [98]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [99]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame

In [151]:
data = pd.DataFrame({'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]})

In [133]:
data

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [134]:
data.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [135]:
data.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [136]:
data.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [137]:
data.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [138]:
 pd.DataFrame(data, columns=['year', 'state'])

   year   state
0  2000    Ohio
1  2001    Ohio
2  2002    Ohio
3  2001  Nevada
4  2002  Nevada
5  2003  Nevada

In [139]:
 pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [140]:
 pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [141]:
 pd.DataFrame(data, columns=['year', 'state', 'pop' , "percent"])

   year   state  pop  percent
0  2000    Ohio  1.5      NaN
1  2001    Ohio  1.7      NaN
2  2002    Ohio  3.6      NaN
3  2001  Nevada  2.4      NaN
4  2002  Nevada  2.9      NaN
5  2003  Nevada  3.2      NaN

In [172]:
frame = pd.DataFrame({'state': ['Lahore', 'Islamabad', 'Dubai', 'Paris', 'Karachi', 'California'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]})

In [173]:
frame

        state  year  pop
0      Lahore  2000  1.5
1   Islamabad  2001  1.7
2       Dubai  2002  3.6
3       Paris  2001  2.4
4     Karachi  2002  2.9
5  California  2003  3.2

In [174]:
pd.DataFrame(frame, columns=['year', 'state', 'pop' , "percent"])

   year       state  pop  percent
0  2000      Lahore  1.5      NaN
1  2001   Islamabad  1.7      NaN
2  2002       Dubai  3.6      NaN
3  2001       Paris  2.4      NaN
4  2002     Karachi  2.9      NaN
5  2003  California  3.2      NaN

In [175]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [176]:
frame['state']

0        Lahore
1     Islamabad
2         Dubai
3         Paris
4       Karachi
5    California
Name: state, dtype: object

In [177]:
frame.state

0        Lahore
1     Islamabad
2         Dubai
3         Paris
4       Karachi
5    California
Name: state, dtype: object

In [184]:
frame["pop"]

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [186]:
 frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [190]:
frame.loc[0]

state    Lahore
year       2000
pop         1.5
Name: 0, dtype: object

In [191]:
frame.loc[4]

state    Karachi
year        2002
pop          2.9
Name: 4, dtype: object

In [192]:
frame['debt'] = 16.5

In [193]:
frame

        state  year  pop  debt
0      Lahore  2000  1.5  16.5
1   Islamabad  2001  1.7  16.5
2       Dubai  2002  3.6  16.5
3       Paris  2001  2.4  16.5
4     Karachi  2002  2.9  16.5
5  California  2003  3.2  16.5

In [195]:
frame['debt'] = np.arange(6.)

In [196]:
frame

        state  year  pop  debt
0      Lahore  2000  1.5   0.0
1   Islamabad  2001  1.7   1.0
2       Dubai  2002  3.6   2.0
3       Paris  2001  2.4   3.0
4     Karachi  2002  2.9   4.0
5  California  2003  3.2   5.0

In [198]:
 val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

In [199]:
frame['debt'] = val

In [200]:
frame

        state  year  pop  debt
0      Lahore  2000  1.5   NaN
1   Islamabad  2001  1.7   NaN
2       Dubai  2002  3.6  -1.2
3       Paris  2001  2.4   NaN
4     Karachi  2002  2.9  -1.5
5  California  2003  3.2  -1.7

In [205]:
frame['eastern'] = frame.state == 'Karachi'

In [206]:
frame

        state  year  pop  debt  eastern
0      Lahore  2000  1.5   NaN    False
1   Islamabad  2001  1.7   NaN    False
2       Dubai  2002  3.6  -1.2    False
3       Paris  2001  2.4   NaN    False
4     Karachi  2002  2.9  -1.5     True
5  California  2003  3.2  -1.7    False

In [207]:
del frame['eastern']

In [208]:
frame

        state  year  pop  debt
0      Lahore  2000  1.5   NaN
1   Islamabad  2001  1.7   NaN
2       Dubai  2002  3.6  -1.2
3       Paris  2001  2.4   NaN
4     Karachi  2002  2.9  -1.5
5  California  2003  3.2  -1.7

In [216]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [217]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [218]:
frame3 = pd.DataFrame(pop)

In [219]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [220]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [222]:
 pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}

In [223]:
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [224]:
 pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [225]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [226]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [228]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

# Index Objects

In [229]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [230]:
index = obj.index

In [231]:
index

Index(['a', 'b', 'c'], dtype='object')

In [232]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])

In [233]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [236]:
frame2 = frame.reindex(['a', 'b', 'c', 'd' , 'e'])

In [237]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [240]:
states = ['Texas', 'California', 'Pakistan']

In [4]:
data = {'x': ['a', 'b', 'c', 'd'],'y': [2, 3,4,5] }
df = pd.DataFrame(data, columns= ["one", 'two'], index = ['i1', 'i2'])

In [5]:
df

    one  two
i1  NaN  NaN
i2  NaN  NaN

In [6]:
v = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
df['col'] = v

In [7]:
v

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [8]:
df

    one  two  col
i1  NaN  NaN  NaN
i2  NaN  NaN  NaN

In [241]:
frame.reindex(columns=states)

   Texas  California  Pakistan
a      1           2       NaN
c      4           5       NaN
d      7           8       NaN

In [242]:
frame.loc[['a', 'b', 'c', 'd'], states]

C:\Users\Shahzad Ahsan\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  California  Pakistan
a    1.0         2.0       NaN
b    NaN         NaN       NaN
c    4.0         5.0       NaN
d    7.0         8.0       NaN

In [243]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [244]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [245]:
new_obj = obj.drop('c')

In [246]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [248]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [249]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [250]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [251]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [252]:
 data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [253]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [254]:
 obj.drop('c', inplace=True)

In [255]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

# Indexing, Selection, and Filtering

In [13]:
import numpy as np
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [14]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [15]:
obj['c']

2.0

In [259]:
obj[1]

1.0

In [260]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [261]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [262]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [263]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [264]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [16]:
obj['a':'c'] = 5

In [17]:
obj

a    5.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [267]:
 data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [268]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [269]:
 data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [270]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [271]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [272]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [273]:
 data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

# Selection with loc and iloc

In [274]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [275]:
data.loc['Colorado', ['two', 'three' , 'one']]

two      5
three    6
one      4
Name: Colorado, dtype: int32

In [276]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [277]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [278]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [279]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [280]:
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [281]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [282]:
 data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [21]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
print(obj3)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
SNames = pd.Series( {'x1': 35000, 'x2': 50000} )

In [26]:
print(SNames + pd.Series( { 'x1':5000, 'x3':2000 } ) )

x1    40000.0
x2        NaN
x3        NaN
dtype: float64

In [27]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002,
2001,2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2] }

In [28]:
df = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'] , index=['one', 'two', 'three', 'four', 'five',
'six'])

In [29]:
df

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN